The output of the command is: Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # module.server_02.aws_ebs_volume.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_ebs_volume" "this" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m availability_zone = "ap-south-1a"
      [32m+[0m[0m encrypted         = (known after apply)
      [32m+[0m[0m final_snapshot    = false
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m iops              = (known after apply)
      [32m+[0m[0m kms_key_id        = (known after apply)
      [32m+[0m[0m size              = 3
      [32m+[0m[0m snapshot_id       = (known after apply)
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Name" = "Server02-NonRoot-0"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Name" = "Server02-NonRoot-0"
        }
      [32m+[0m[0m throughput        = (known after apply)
      [32m+[0m[0m type              = "gp3"
    }

[1m  # module.server_02.aws_ebs_volume.this[1][0m will be created
[0m  [32m+[0m[0m resource "aws_ebs_volume" "this" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m availability_zone = "ap-south-1a"
      [32m+[0m[0m encrypted         = (known after apply)
      [32m+[0m[0m final_snapshot    = false
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m iops              = (known after apply)
      [32m+[0m[0m kms_key_id        = (known after apply)
      [32m+[0m[0m size              = 4
      [32m+[0m[0m snapshot_id       = (known after apply)
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Name" = "Server02-NonRoot-1"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Name" = "Server02-NonRoot-1"
        }
      [32m+[0m[0m throughput        = (known after apply)
      [32m+[0m[0m type              = "gp3"
    }

[1m  # module.server_02.aws_instance.ec2_server[0m will be created
[0m  [32m+[0m[0m resource "aws_instance" "ec2_server" {
      [32m+[0m[0m ami                                  = "ami-04708942c263d8190"
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m associate_public_ip_address          = (known after apply)
      [32m+[0m[0m availability_zone                    = (known after apply)
      [32m+[0m[0m cpu_core_count                       = (known after apply)
      [32m+[0m[0m cpu_threads_per_core                 = (known after apply)
      [32m+[0m[0m disable_api_stop                     = (known after apply)
      [32m+[0m[0m disable_api_termination              = false
      [32m+[0m[0m ebs_optimized                        = (known after apply)
      [32m+[0m[0m get_password_data                    = false
      [32m+[0m[0m host_id                              = (known after apply)
      [32m+[0m[0m host_resource_group_arn              = (known after apply)
      [32m+[0m[0m iam_instance_profile                 = (known after apply)
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_initiated_shutdown_behavior = (known after apply)
      [32m+[0m[0m instance_lifecycle                   = (known after apply)
      [32m+[0m[0m instance_state                       = (known after apply)
      [32m+[0m[0m instance_type                        = "t2.micro"
      [32m+[0m[0m ipv6_address_count                   = (known after apply)
      [32m+[0m[0m ipv6_addresses                       = (known after apply)
      [32m+[0m[0m key_name                             = "pem-key"
      [32m+[0m[0m monitoring                           = (known after apply)
      [32m+[0m[0m outpost_arn                          = (known after apply)
      [32m+[0m[0m password_data                        = (known after apply)
      [32m+[0m[0m placement_group                      = (known after apply)
      [32m+[0m[0m placement_partition_number           = (known after apply)
      [32m+[0m[0m primary_network_interface_id         = (known after apply)
      [32m+[0m[0m private_dns                          = (known after apply)
      [32m+[0m[0m private_ip                           = (known after apply)
      [32m+[0m[0m public_dns                           = (known after apply)
      [32m+[0m[0m public_ip                            = (known after apply)
      [32m+[0m[0m secondary_private_ips                = (known after apply)
      [32m+[0m[0m security_groups                      = (known after apply)
      [32m+[0m[0m spot_instance_request_id             = (known after apply)
      [32m+[0m[0m subnet_id                            = (known after apply)
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Name" = "Server02"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Name" = "Server02"
        }
      [32m+[0m[0m tenancy                              = (known after apply)
      [32m+[0m[0m user_data                            = (known after apply)
      [32m+[0m[0m user_data_base64                     = (known after apply)
      [32m+[0m[0m user_data_replace_on_change          = false
      [32m+[0m[0m vpc_security_group_ids               = (known after apply)

      [32m+[0m[0m metadata_options {
          [32m+[0m[0m http_endpoint               = "enabled"
          [32m+[0m[0m http_protocol_ipv6          = "disabled"
          [32m+[0m[0m http_put_response_hop_limit = 2
          [32m+[0m[0m http_tokens                 = "required"
          [32m+[0m[0m instance_metadata_tags      = (known after apply)
        }

      [32m+[0m[0m network_interface {
          [32m+[0m[0m delete_on_termination = false
          [32m+[0m[0m device_index          = 0
          [32m+[0m[0m network_card_index    = 0
          [32m+[0m[0m network_interface_id  = (known after apply)
        }

      [32m+[0m[0m root_block_device {
          [32m+[0m[0m delete_on_termination = true
          [32m+[0m[0m device_name           = (known after apply)
          [32m+[0m[0m encrypted             = (known after apply)
          [32m+[0m[0m iops                  = (known after apply)
          [32m+[0m[0m kms_key_id            = (known after apply)
          [32m+[0m[0m tags                  = {
              [32m+[0m[0m "Name" = "Server02-RootVolume"
            }
          [32m+[0m[0m throughput            = (known after apply)
          [32m+[0m[0m volume_id             = (known after apply)
          [32m+[0m[0m volume_size           = 12
          [32m+[0m[0m volume_type           = "gp3"
        }
    }

[1m  # module.server_02.aws_network_interface.eni[0m will be created
[0m  [32m+[0m[0m resource "aws_network_interface" "eni" {
      [32m+[0m[0m arn                       = (known after apply)
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m interface_type            = (known after apply)
      [32m+[0m[0m ipv4_prefix_count         = (known after apply)
      [32m+[0m[0m ipv4_prefixes             = (known after apply)
      [32m+[0m[0m ipv6_address_count        = (known after apply)
      [32m+[0m[0m ipv6_address_list         = (known after apply)
      [32m+[0m[0m ipv6_address_list_enabled = false
      [32m+[0m[0m ipv6_addresses            = (known after apply)
      [32m+[0m[0m ipv6_prefix_count         = (known after apply)
      [32m+[0m[0m ipv6_prefixes             = (known after apply)
      [32m+[0m[0m mac_address               = (known after apply)
      [32m+[0m[0m outpost_arn               = (known after apply)
      [32m+[0m[0m owner_id                  = (known after apply)
      [32m+[0m[0m private_dns_name          = (known after apply)
      [32m+[0m[0m private_ip                = (known after apply)
      [32m+[0m[0m private_ip_list           = (known after apply)
      [32m+[0m[0m private_ip_list_enabled   = false
      [32m+[0m[0m private_ips               = (known after apply)
      [32m+[0m[0m private_ips_count         = (known after apply)
      [32m+[0m[0m security_groups           = [
          [32m+[0m[0m "sg-063bfb276ea028c07",
        ]
      [32m+[0m[0m source_dest_check         = true
      [32m+[0m[0m subnet_id                 = "subnet-00848b73f86a37141"
      [32m+[0m[0m tags                      = {
          [32m+[0m[0m "Name" = "eni-Server02"
        }
      [32m+[0m[0m tags_all                  = {
          [32m+[0m[0m "Name" = "eni-Server02"
        }
    }

[1m  # module.server_02.aws_volume_attachment.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_volume_attachment" "this" {
      [32m+[0m[0m device_name = "/dev/sdb"
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m instance_id = (known after apply)
      [32m+[0m[0m volume_id   = (known after apply)
    }

[1m  # module.server_02.aws_volume_attachment.this[1][0m will be created
[0m  [32m+[0m[0m resource "aws_volume_attachment" "this" {
      [32m+[0m[0m device_name = "/dev/sdc"
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m instance_id = (known after apply)
      [32m+[0m[0m volume_id   = (known after apply)
    }

[1m  # module.sg_server01.aws_security_group.this[0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "this" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "Managed by Terraform"
      [32m+[0m[0m egress                 = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m description      = ""
              [32m+[0m[0m from_port        = 0
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "-1"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 0
            },
        ]
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m description      = "HTTP"
              [32m+[0m[0m from_port        = 80
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 80
            },
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m description      = "SSH"
              [32m+[0m[0m from_port        = 22
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 22
            },
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = []
              [32m+[0m[0m description      = "Self referancing SG"
              [32m+[0m[0m from_port        = 0
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "-1"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = true
              [32m+[0m[0m to_port          = 0
            },
        ]
      [32m+[0m[0m name                   = (known after apply)
      [32m+[0m[0m name_prefix            = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Name" = "SG-server01"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Name" = "SG-server01"
        }
      [32m+[0m[0m vpc_id                 = "vpc-03fdbc523087cf289"
    }

[1mPlan:[0m 7 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...